<a href="https://colab.research.google.com/github/indranildchandra/ML101-Codelabs/blob/master/src/Handle_Missing_Values_Pandas_Example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

### Create a Dataset

In [0]:
data = {
    "student_first_name": ["Ander", np.nan, "Scott", "Andreas", "Paul"],
    "student_last_name": ["Herrera", np.nan, "McTominay", "Pereira", "Pogba"],
    "student_age": [21, np.nan, 39, 15, 6],
    "student_gender": ["M", np.nan, "M", "M", "F"],
    "previous_sem_score": [95, np.nan, np.nan, 85, 78],
    "current_sem_score": [82, np.nan, np.nan, 68, 75]
}

In [0]:
df = pd.DataFrame(
      data, 
      columns=["student_first_name", "student_last_name", "student_age", "student_gender", "previous_sem_score", "current_sem_score"]
     )

In [22]:
df

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score
0,Ander,Herrera,21.0,M,95.0,82.0
1,NaN,NaN,NaN,NaN,NaN,NaN
2,Scott,McTominay,39.0,M,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0
4,Paul,Pogba,6.0,F,78.0,75.0

### Drop rows with any missing value

In [23]:
df_dropped_missing_values = df.dropna()
df_dropped_missing_values

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score
0,Ander,Herrera,21.0,M,95.0,82.0
3,Andreas,Pereira,15.0,M,85.0,68.0
4,Paul,Pogba,6.0,F,78.0,75.0

### Drop rows with all column entries with missing values

In [24]:
df_cleaned = df.dropna(how='all')
df_cleaned

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score
0,Ander,Herrera,21.0,M,95.0,82.0
2,Scott,McTominay,39.0,M,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0
4,Paul,Pogba,6.0,F,78.0,75.0

In [25]:
df["address"] = np.nan
df

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score,address
0,Ander,Herrera,21.0,M,95.0,82.0,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Scott,McTominay,39.0,M,NaN,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0,NaN
4,Paul,Pogba,6.0,F,78.0,75.0,NaN

### Drop columns with all missing values

In [26]:
df.dropna(axis=1, how='all')

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score
0,Ander,Herrera,21.0,M,95.0,82.0
1,NaN,NaN,NaN,NaN,NaN,NaN
2,Scott,McTominay,39.0,M,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0
4,Paul,Pogba,6.0,F,78.0,75.0

### Replace all NA values with 0

In [27]:
df.fillna(0)

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score,address
0,Ander,Herrera,21.0,M,95.0,82.0,0.0
1,0,0,0.0,0,0.0,0.0,0.0
2,Scott,McTominay,39.0,M,0.0,0.0,0.0
3,Andreas,Pereira,15.0,M,85.0,68.0,0.0
4,Paul,Pogba,6.0,F,78.0,75.0,0.0

### Replace all NA values with mean value of the column

In [28]:
df["previous_sem_score"].fillna(df["previous_sem_score"].mean(), inplace=True)
df

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score,address
0,Ander,Herrera,21.0,M,95.0,82.0,NaN
1,NaN,NaN,NaN,NaN,86.0,NaN,NaN
2,Scott,McTominay,39.0,M,86.0,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0,NaN
4,Paul,Pogba,6.0,F,78.0,75.0,NaN

### Filter rows where age and gender is not null

In [29]:
df[df["student_age"].notnull() & df["student_gender"].notnull()]

,student_first_name,student_last_name,student_age,student_gender,previous_sem_score,current_sem_score,address
0,Ander,Herrera,21.0,M,95.0,82.0,NaN
2,Scott,McTominay,39.0,M,86.0,NaN,NaN
3,Andreas,Pereira,15.0,M,85.0,68.0,NaN
4,Paul,Pogba,6.0,F,78.0,75.0,NaN